blast_incompr/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    
        {
            type            table;
            values          
3
(
(0 (0 0 0))
(0.001 (65.2 0 0))
(0.02 (0 0 0))
)
;
        }
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    pipe
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
