blast_incompr/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 104.58;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 104.58;
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    pipe
    {
        type            epsilonWallFunction;
        value           uniform 104.58;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
