blast_incompr/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#include "forceCoeffs"

yPlus1
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        timeStart       1;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
    }


forces1
    {
          type          forces;
          libs          ("libforces.so");
          patches       (pipe);
          
          CofR            (0 0 0);    // Axle midpoint on ground
          rho             rhoInf; 
          rhoInf          1;           // Redundant for incompressible
    }

// ************************************************************************* //
